
&НаКлиенте
Процедура ДекорацияПорталСотрудникаНажатие(Элемент)
	KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПанельВиджетов","Форма");
КонецПроцедуры

&НаКлиенте
Процедура ТактическаяПанельНажатие(Элемент)
	
	ПараметрыОткрытия = Новый Структура("НаименованиеПанели","Тактическая панель");
	KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПанельВиджетов","Форма",ПараметрыОткрытия);
	
КонецПроцедуры

&НаКлиенте
Процедура ПроформаПлановФактовНажатие(Элемент)
	
	KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПроформаПлановИФактов","Форма");
	
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПланированияНажатие(Элемент)
	
	ОткрытьФорму("Документ.KPI_Планирование.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ДекорацияСмартЗадачиНажатие(Элемент)
	
	ОткрытьФорму("Документ.KPI_СмартЗадача.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура МоделиПланированияНажатие(Элемент)
	
	ОткрытьФорму("Справочник.KPI_МоделиПланирования.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура СценарииПланированияНажатие(Элемент)
	
	ОткрытьФорму("Справочник.KPI_СценарииПланирования.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура KPI_МатрицыРаспределенияНажатие(Элемент)
	
	ОткрытьФорму("Справочник.KPI_МатрицыРаспределения.ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура KPI_ВводФактовВыполненияНажатие(Элемент)
	
	ОткрытьФорму("Документ.KPI_ВводФактовВыполнения.ФормаСписка");
	
КонецПроцедуры
