
&НаКлиенте
Процедура ИспользоватьПривязкуМоделиКСотрудникуПриИзменении(Элемент)
	
	УстановитьВидимостьЭлементов();
	
КонецПроцедуры

Процедура УстановитьВидимостьЭлементов()
	
	Элементы.Должность.Видимость    = Не  Объект.ИспользоватьПривязкуМоделиКСотруднику;
	Элементы.Квалификация.Видимость = Не  Объект.ИспользоватьПривязкуМоделиКСотруднику;
    Элементы.Сотрудник.Видимость    = Объект.ИспользоватьПривязкуМоделиКСотруднику;
	
КонецПроцедуры	

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УстановитьВидимостьЭлементов();
	ВидимостьВкладкиСтандартов();
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьВкладкиСтандартов()
	
	Элементы.Группа7.Видимость = ВидимостьВкладкиСтандарты();
	Если Не ВидимостьВкладкиСтандарты() Тогда
		Объект.Стандарты.Очистить();
	КонецЕсли;	
	
КонецПроцедуры	

&НаСервере
Функция ВидимостьВкладкиСтандарты()
	
	ТЧ = РеквизитФормыВЗначение("Объект").ДанныеМодели;
	Если ТЧ.Найти(Справочники.KPI_ЦелевыеПоказатели.Стандарт, "ЦелевойПоказатель") = Неопределено Тогда
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;	
	
КонецФункции

&НаКлиенте
Процедура ДанныеМоделиПриИзменении(Элемент)
	
	ВидимостьВкладкиСтандартов();

КонецПроцедуры

&НаКлиенте
Процедура ДанныеМоделиОтветственныйПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(ТекущаяДата(), ЭтаФорма, СтандартнаяОбработка, Истина, ТекущийЭлемент.ТекущиеДанные.Ответственный);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.Ответственный = ОбъектУправления.СтруктураКомпании;
		ТекущийЭлемент.ТекущиеДанные.ОтветственныйПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(ОбъектУправления.СтруктураКомпании, ТекущаяДата());
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеМоделиОтветственныйПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	ТекущийЭлемент.ТекущиеДанные.Ответственный = ПредопределенноеЗначение("Справочник.KPI_СтруктураКомпании.ПустаяСсылка");
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Элемент Из Объект.ДанныеМодели Цикл
		Элемент.ОтветственныйПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Элемент.Ответственный, ТекущаяДата());
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(ТекущаяДата(), ЭтаФорма, СтандартнаяОбработка, Истина, ?(ЗначениеЗаполнено(Объект.Сотрудник), KPI_ОбщегоНазначенияСервер.ПолучитьСтруктуруКомпанииПоСотруднику(Объект.Сотрудник), Неопределено));
	
	Если Не ОбъектУправления = Неопределено Тогда
		Объект.Сотрудник = ОбъектУправления.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если Объект.ИспользоватьПривязкуМоделиКСотруднику И Не ЗначениеЗаполнено(Объект.Сотрудник) Тогда
		Сообщить("Не указан сотрудник");
		Отказ = Истина;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.ИспользоватьПривязкуМоделиКСотруднику Тогда 
		ТекущийОбъект.Должность = Неопределено;
		ТекущийОбъект.Квалификация = Неопределено;
	Иначе 
		ТекущийОбъект.Сотрудник = Неопределено;
	КонецЕсли;
КонецПроцедуры
