
Процедура ПриЗаписи(Отказ)
		
	ГрафикРаботы                                  = РегистрыСведений.KPI_ГрафикиРабот.СоздатьНаборЗаписей();
	ГрафикРаботы.Отбор.ГрафикРаботы.Значение      = Ссылка;
	ГрафикРаботы.Отбор.ГрафикРаботы.Использование = Истина;
	ГрафикРаботы.Очистить();
	ГрафикРаботы.Записать();
	ГрафикРаботы.Записывать                       = Истина;

	
	Для Каждого ГрафикМесяца из ДанныеГрафика Цикл
		Дата                 = НачалоМесяца(ГрафикМесяца.Месяц);
		КоличествоДнейМесяца = KPI_ИнтерфейсКлиентСервер.КоличествоДнейМесяца(Дата);
		Для НомерДня = 1 по КоличествоДнейМесяца Цикл
			ДеньГрафика              = ГрафикРаботы.Добавить();
			ДеньГрафика.ГрафикРаботы = Ссылка;
			ДеньГрафика.Дата         = Дата;
			ДеньГрафика.ВидДня       = ГрафикМесяца["ВидДня" + НомерДня];
			КоличествоРабочихЧасов   = ГрафикМесяца["Часов"  + НомерДня];
			ДеньГрафика.Часы         = КоличествоРабочихЧасов;
			Дата                     = Дата + 86400; //60*60*24
		КонецЦикла;
		 
	КонецЦикла;
	
	ГрафикРаботы.Записать();
	
КонецПроцедуры

//Процедура заполняет данные графика
//Параметры:
// НачалоПериода  - тип дата, укзавает дату с которой начинается заполнение
Процедура ЗаполнитьДанныеГрафика(НачалоПериодаЗаполнения = Неопределено) Экспорт
	
	Если KPI_ПереопределяемыйСервер.ИнтегрированныйФункционал() Тогда
		KPI_ПереопределяемыйСервер.ЗаполнитьГрафикПоДаннымПроизводственногоКалендаря(ЭтотОбъект)
	Иначе 
		ЗаполнитьДанныеГрафикаСменный(НачалоПериодаЗаполнения);				
	КонецЕсли;
	
	//посчитаем суммы часов и дней
	Для м = 1 По 12 Цикл
		СтрГрафика = ДанныеГрафика.Получить(м - 1);
		
		сумм = 0;
		колво = 0;
		
		Для д = 1 По 31 Цикл
			ТекЧасов = СтрГрафика["Часов" + д];
			
			сумм = сумм + ТекЧасов;
			
			Если ТекЧасов > 0 Тогда
				колво = колво + 1;
			КонецЕсли;
		КонецЦикла;
		
		СтрГрафика.ИтогоЧасов = сумм;
		СтрГрафика.ИтогоДней = колво;
	КонецЦикла;

	Записать();
	
КонецПроцедуры

Процедура ЗаполнитьДанныеГрафикаСменный(НачалоПериодаЗаполнения)
	
	НачальнаяДата           = Дата(Формат(Год,"ЧГ=")+"0101");
	НачальнаяДата           = НачалоПериодаЗаполнения;
	КонечнаяДата            = Дата(Формат(Год,"ЧГ=")+"1231");
	КоличествоРабочихДней   = ФормулаГрафика.ЧислоРабочихДней;
	КоличествоВыходныхДней  = ФормулаГрафика.ЧислоВыходныхДней;
	
	ДанныеГрафика.Очистить();
	
	НачалоМесяца = НачалоМесяца(НачальнаяДата);
	Для НомерМесяца = 0 по 11 Цикл
		нСтр              = ДанныеГрафика.Добавить();
		НСтр.Месяц        = ДобавитьМесяц(НачалоМесяца,НомерМесяца);
	КонецЦикла;
	
	Пока НачальнаяДата < КонечнаяДата Цикл
		
		Если НачальнаяДата < КонечнаяДата Тогда
        	ЗаполнитьРабочиеДни(НачальнаяДата,КоличествоРабочихДней);
		КонецЕсли;
	
		Если НачальнаяДата < КонечнаяДата Тогда
			ЗаполнитьВыходныеДни(НачальнаяДата,КоличествоВыходныхДней);
		КонецЕсли;
		
	КонецЦикла;
	
	Если НЕ ФормулаГрафика.СкользящийГрафик Тогда
		ПраздничныеДни          = Справочники.KPI_ГрафикиРабот.ПраздничныеДни(Год);
		Праздник                = Перечисления.KPI_ВидыДнейГрафика.Праздник;
		Предпраздничный         = Перечисления.KPI_ВидыДнейГрафика.Предпраздничный;
        
		Пока ПраздничныеДни.Следующий() Цикл
			
			ИндексМесяца  = Месяц(ПраздничныеДни.Дата) - 1;
			НомерДня      = Строка(День(ПраздничныеДни.Дата));
			СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
			СтрокаГрафика["ВидДня" + НомерДня] =  ПраздничныеДни.ВидДня;
			Если  ПраздничныеДни.ВидДня = Праздник Тогда
				СтрокаГрафика["Часов"  + НомерДня] = 0;
			ИначеЕсли ПраздничныеДни.ВидДня = Предпраздничный Тогда
				СтрокаГрафика["Часов"  + НомерДня] = РабочихЧасов - 1;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	ДанныеГрафика.Сортировать("Месяц");
	
КонецПроцедуры

Функция ЗаполнитьВыходныеДни(ДатаМесяца,Знач ЧислоВыходныхДней)
		
	КонецМесяца   = КонецМесяца(ДатаМесяца);
	ИндексМесяца  = Месяц(ДатаМесяца) - 1;
	СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
	ВыходнойДень  = Перечисления.KPI_ВидыДнейГрафика.Выходной;
	Пока НЕ ЧислоВыходныхДней = 0 И НЕ КонецМесяца < ДатаМесяца Цикл
		
		НомерДня = Строка(День(ДатаМесяца));
		СтрокаГрафика["Часов"  + НомерДня] = 0;
		СтрокаГрафика["ВидДня" + НомерДня]                 = ВыходнойДень;
		ДатаМесяца = ДатаМесяца + 86400;

		ЧислоВыходныхДней = ЧислоВыходныхДней - 1;
		
	КонецЦикла;
	

	
	Если ЧислоВыходныхДней Тогда
		Если ДатаМесяца = КонецГода(КонецМесяца)+1  Тогда
		 ЗаполнитьВыходныеДни(ДатаМесяца,ЧислоВыходныхДней);
		 КонецЕсли;
	КонецЕсли;
	
КонецФункции

Функция ЗаполнитьРабочиеДни(ДатаМесяца,Знач ЧислоРабочихДней)
	
	КонецМесяца   = КонецМесяца(ДатаМесяца);
	ИндексМесяца  = Месяц(ДатаМесяца) - 1;
	СтрокаГрафика = ДанныеГрафика.Получить(ИндексМесяца);
	РабочийДень   = Перечисления.KPI_ВидыДнейГрафика.Рабочий;
	Пока НЕ ЧислоРабочихДней = 0 И НЕ КонецМесяца < ДатаМесяца Цикл
		
		НомерДня = Строка(День(ДатаМесяца));
		СтрокаГрафика["Часов"  + Строка(День(ДатаМесяца))] = РабочихЧасов;
		СтрокаГрафика["ВидДня" + НомерДня]                 = РабочийДень;
		
		ДатаМесяца = ДатаМесяца + 86400;

		ЧислоРабочихДней = ЧислоРабочихДней - 1;
		
	КонецЦикла;
		
	Если ЧислоРабочихДней Тогда
		Если НЕ ДатаМесяца = КонецГода(КонецМесяца)+1 Тогда
			ЗаполнитьРабочиеДни(ДатаМесяца,ЧислоРабочихДней);
		КонецЕсли;
	КонецЕсли;
	
КонецФункции

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Год = Год(ТекущаяДата())
	
КонецПроцедуры



