
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр KPI_ВзаимосвязьЦелей
	Движения.KPI_ВзаимосвязьЦелей.Записывать = Истина;
	Для Каждого ТекСтрокаЗависимыеЦели Из ЗависимыеЦели Цикл
		Движение               = Движения.KPI_ВзаимосвязьЦелей.Добавить();
		Движение.Период        = Дата;
		Движение.Цель          = ТекСтрокаЗависимыеЦели.Цель;
		Движение.ЗависимаяЦель = ТекСтрокаЗависимыеЦели.ЗависимаяЦель;
		Движение.Периодичность = Периодичность;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	
	
	
	
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	// регистр KPI_ВзаимосвязьЦелейИПоказателей
	Движения.KPI_ВзаимосвязьЦелейИПоказателей.Записывать = Истина;
	Для Каждого ТекСтрокаЗависимыеЦелевыеПоказатели Из ЗависимыеЦелевыеПоказатели Цикл
		Движение                          = Движения.KPI_ВзаимосвязьЦелейИПоказателей.Добавить();
		Движение.Период                   = Дата;
		Движение.Цель                     = ТекСтрокаЗависимыеЦелевыеПоказатели.Цель;
		Движение.ЦелевойПоказатель        = ТекСтрокаЗависимыеЦелевыеПоказатели.ЦелевойПоказатель;
		Движение.СтруктураКомпании        = СтруктураКомпании;
		Движение.Периодичность            = Периодичность;
		Движение.Вес                      = ТекСтрокаЗависимыеЦелевыеПоказатели.Вес;
		Движение.КлючАналитики            = ТекСтрокаЗависимыеЦелевыеПоказатели.КлючАналитики;
		Движение.ОтборПоСтруктуреКомпании = ТекСтрокаЗависимыеЦелевыеПоказатели.ОтборПоСтруктуреКомпании;
	КонецЦикла;
	
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
