&НаКлиенте
Процедура КомандаОК(Команда)
	
	Если ПроверитьФормулу() Тогда	
		Структура = Новый Структура;
		Структура.Вставить("Реквизит", "Формула");
		Структура.Вставить("ЗначениеРеквизита", ТелоФормулы.ПолучитьТекст());
		ОповеститьОВыборе(Структура);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПроверитьФормулу()
	Формула = ТелоФормулы.ПолучитьТекст();
	
	ПредставленияФормулы = ТаблицаАргументы.Выгрузить().ВыгрузитьКолонку("Представление");
	
	КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
	ФормулаКорректна = КриптоМодуль.ПроверитьФормулу(Формула, ПредставленияФормулы);
	 
	Возврат ФормулаКорректна;
КонецФункции

&НаКлиенте
Процедура КомандаЗакрыть(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура Команда1(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "1");
КонецПроцедуры

&НаКлиенте
Процедура Команда2(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "2");
КонецПроцедуры

&НаКлиенте
Процедура Команда3(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "3");
КонецПроцедуры

&НаКлиенте
Процедура Команда4(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "4");
КонецПроцедуры

&НаКлиенте
Процедура Команда5(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "5");
КонецПроцедуры

&НаКлиенте
Процедура Команда6(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "6");
КонецПроцедуры

&НаКлиенте
Процедура Команда7(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "7");
КонецПроцедуры

&НаКлиенте
Процедура Команда8(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "8");
КонецПроцедуры

&НаКлиенте
Процедура Команда9(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "9");
КонецПроцедуры

&НаКлиенте
Процедура Команда0(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "0");
КонецПроцедуры

&НаКлиенте
Процедура КомандаТочка(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + ".");
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗапятая(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + ",");
КонецПроцедуры

&НаКлиенте
Процедура КомандаПлюс(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "+");
КонецПроцедуры

&НаКлиенте
Процедура КомандаМинус(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "-");
КонецПроцедуры

&НаКлиенте
Процедура КомандаУмножить(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "*");
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазделить(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "/");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобкаЛевая(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "(");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСкобкаПравая(Команда)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + ")");
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтеретьСимвол(Команда)
	Стр = ТелоФормулы.ПолучитьТекст();
	
	Если Прав(Стр, 1) = "]" Тогда
		Пока Прав(Стр, 1) <> "[" Цикл
			ТелоФормулы.УстановитьТекст(Лев(Стр, СтрДлина(Стр)-1));
			Стр = ТелоФормулы.ПолучитьТекст();
		КонецЦикла;
	КонецЕсли;
	
	ТелоФормулы.УстановитьТекст(Лев(Стр, СтрДлина(Стр)-1));
КонецПроцедуры

&НаКлиенте
Процедура КомандаСтеретьВсе(Команда)
	ТелоФормулы.Очистить();
КонецПроцедуры


&НаКлиенте
Процедура ТаблицаАргументыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	ТелоФормулы.УстановитьТекст(ТелоФормулы.ПолучитьТекст() + "[" + Элемент.ТекущиеДанные.Представление + "]");
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Для каждого Стр Из Параметры.СЗ Цикл
		Если Стр.Значение <> "" Тогда
			НовСтр = ТаблицаАргументы.Добавить();
			НовСтр.Представление = Стр.Значение;
		КонецЕсли;
	КонецЦикла;
	
	ТелоФормулы.УстановитьТекст(Параметры.Формула);
КонецПроцедуры


