
&НаКлиенте
Процедура Проверить(Команда)
	СтруктураПараметров = Новый Структура;
	СтруктураПараметров.Вставить("ВерсияПлатформы", Объект.ВерсияПлатформы);
	СтруктураПараметров.Вставить("ТипИБ", Объект.ТипИБ);
	СтруктураПараметров.Вставить("КаталогИБ", Объект.КаталогИБ);
	СтруктураПараметров.Вставить("ИмяСервераИБ", Объект.ИмяСервераИБ);
	СтруктураПараметров.Вставить("ИмяИБНаСервере", Объект.ИмяИБНаСервере);
	СтруктураПараметров.Вставить("АутентификацияWindows", Объект.АутентификацияWindows);
	СтруктураПараметров.Вставить("ПользовательИБ", Объект.ПользовательИБ);
	СтруктураПараметров.Вставить("ПарольИБ", Объект.ПарольИБ);
	
	KPI_ОбщегоНазначения.ПроверитьСоединение(СтруктураПараметров);
КонецПроцедуры




&НаКлиенте
Процедура ТипИБПриИзменении(Элемент)
	ПоказатьПараметрыПодключения();
КонецПроцедуры


&НаКлиенте
Процедура ПоказатьПараметрыПодключения()
	Если Объект.ТипИБ Тогда
		Элементы.КаталогИБ.Видимость = Ложь;
		Элементы.ИмяСервераИБ.Видимость = Истина;
		Элементы.ИмяИБНаСервере.Видимость = Истина;
	Иначе 
		Элементы.КаталогИБ.Видимость = Истина;
		Элементы.ИмяСервераИБ.Видимость = Ложь;
		Элементы.ИмяИБНаСервере.Видимость = Ложь;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура АутентификацияWindowsПриИзменении(Элемент)
	Элементы.ПользовательИБ.Доступность = Не Элементы.ПользовательИБ.Доступность;
	Элементы.ПарольИБ.Доступность = Не Элементы.ПарольИБ.Доступность;
	Объект.ПарольИБ = "";
КонецПроцедуры


&НаКлиенте
Процедура КаталогИБНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
	
	ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
	
	Если ДиалогОткрытия.Выбрать() Тогда
		Объект.КаталогИБ = ДиалогОткрытия.Каталог;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Объект.Предопределенный Тогда
		Сообщить("Запрещено изменять предопределенный элемент справочника");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	ПоказатьПараметрыПодключения();
КонецПроцедуры
