
&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запись                   = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = ТекущийОбъект.Ссылка;
		Запись.Прочитать();
		Запись.СтруктураКомпании = ТекущийОбъект.Ссылка;
		Запись.Период            = ДатаСозданияСтруктуры;
		Запись.Записать();
	КонецЕсли;
	
	Если СоставРолейИзменен Тогда
		Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(Объект.Ссылка,ТекущаяДата());
		Если ЗначениеЗаполнено(Сотрудник) Тогда
			КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
			КриптоМодуль.ИзменитьСоставРолейСотрудника(Сотрудник);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("ДатаСозданияСтруктуры",ЭтаФорма.ДатаСозданияСтруктуры);
	Оповестить("ИзменениеСтруктурыКомпании",,Объект.Ссылка);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если НЕ Параметры.Свойство("ДатаСозданияСтруктуры",ЭтаФорма.ДатаСозданияСтруктуры)
			ИЛИ Не ЗначениеЗаполнено(ЭтаФорма.ДатаСозданияСтруктуры) Тогда
			Отказ = Истина;
			KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! Не указана дата создания элемента структуры.");				
		КонецЕсли;
	Иначе 
		Элементы.ДатаСозданияСтруктуры.Видимость = Ложь;	
	КонецЕсли;
	
	КритерийПоиска = Новый Структура("Имя");
	КритерийРольKPI = "KPI";
	Для Каждого Роль из Метаданные.Роли Цикл
		
		Если Найти(Роль.Имя,КритерийРольKPI) Тогда 
			СтрокаРоль = ЭтаФорма.РолиОбъектаУправления.Добавить();
			ЗаполнитьЗначенияСвойств(СтрокаРоль,Роль);
			КритерийПоиска.Имя = Роль.Имя;
			НайденаяСтрока     = Объект.РолиОбъектаУправления.НайтиСтроки(КритерийПоиска);
			СтрокаРоль.Выбрано = ЗначениеЗаполнено(НайденаяСтрока);
		КонецЕсли;
		
	КонецЦикла;

	СоставРолейИзменен = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура РолиОбъектаУправленияВыбраноПриИзменении(Элемент)
	
	ТекущиеДаные = Элементы.РолиОбъектаУправления.ТекущиеДанные;
	
	КритерийПоиска     = Новый Структура("Имя");
	КритерийПоиска.Имя = ТекущиеДаные.Имя;
	НайденныеСтроки     = Объект.РолиОбъектаУправления.НайтиСтроки(КритерийПоиска);
	
	Для Каждого НайденнаяСтрока из НайденныеСтроки Цикл
		Объект.РолиОбъектаУправления.Удалить(НайденнаяСтрока);
	КонецЦикла;
	
	Если ТекущиеДаные.Выбрано Тогда 
		СтрокаРоль = Объект.РолиОбъектаУправления.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаРоль,ТекущиеДаные);		
	КонецЕсли;
	
	СоставРолейИзменен = Истина;
			
КонецПроцедуры




