
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("СписокСтруктур") Тогда
		Для Каждого Элем Из Параметры.СписокСтруктур Цикл
			НовСтр = ТаблЗнач.Добавить();
			НовСтр.СтруктураКомпании = Элем.Значение;
			НовСтр.СтруктураКомпанииПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Элем.Значение, Параметры.Дата);
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	СЗ = Новый СписокЗначений;
	
	Для Каждого Стр Из ТаблЗнач Цикл
		СЗ.Добавить(Стр.СтруктураКомпании);
	КонецЦикла;
	
	ОповеститьОВыборе(СЗ);
КонецПроцедуры


&НаКлиенте
Процедура Подбор(Команда)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Параметры.Дата, Элементы.ТаблЗнач, Ложь, , Неопределено, , Ложь);
КонецПроцедуры


&НаКлиенте
Процедура ТаблЗначСтруктураКомпанииПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Параметры.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпанииПредставление = ОбъектУправления.СтруктураКомпанииПредставление;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ТаблЗначСтруктураКомпанииПредставлениеОткрытие(Элемент, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	ОткрытьЗначение(ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
КонецПроцедуры


&НаКлиенте
Процедура ТаблЗначОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Если Не ВыбранноеЗначение = Неопределено Тогда
		НовСтр = ТаблЗнач.Добавить();
		НовСтр.СтруктураКомпании = ВыбранноеЗначение.СтруктураКомпании;
		НовСтр.СтруктураКомпанииПредставление = ВыбранноеЗначение.СтруктураКомпанииПредставление;
	КонецЕсли;
КонецПроцедуры




