// Процедура выполняет обновление информационной базы до требуемой версии.
// Предназначена для вызова при начале работы системы в случае, если значение
// константы KPI_ВерсияКонфигурации не соответствует глобальной переменной KPI_глВерсияКонфигурации
// Параметры:
// 	нет
// Возвращаемое значение:
//  нет
Процедура ВыполнитьОбновление() Экспорт
	
	ТекущаяВерсияКонфигурации = KPI_ОбщегоНазначенияСервер.ПолучитьВерсиюКонфигурации();
	
	Если ТекущаяВерсияКонфигурации = "2.0.0.0"
		Или ТекущаяВерсияКонфигурации = "2.0.0.1"
		Или ТекущаяВерсияКонфигурации = "2.0.0.2"
		Или ТекущаяВерсияКонфигурации = "2.0.0.3"
		Или ТекущаяВерсияКонфигурации = "2.0.0.4"
		Или ТекущаяВерсияКонфигурации = "2.0.0.5"
		Или ТекущаяВерсияКонфигурации = "2.0.0.6"
		Или ТекущаяВерсияКонфигурации = "2.0.0.7"
		Или ТекущаяВерсияКонфигурации = "2.0.0.8"
		Или ТекущаяВерсияКонфигурации = "2.0.0.9"
		Или ТекущаяВерсияКонфигурации = "2.0.1.0"
		Тогда
		НачатьТранзакцию();
		Сообщить("Выполняем обновление на 2.0.1.1");
		Константы.KPI_ВерсияКонфигурации.Установить("2.0.1.1");
		ЗафиксироватьТранзакцию();
	КонецЕсли;
	
КонецПроцедуры



