
Процедура ПриЗаписи(Отказ)
	
	ИнтервалыШкалы.Сортировать("НижнийПорог Возр");
	
	
	//Для НомерСтроки = 0 По ИнтервалыШкалы.Количество() - 2 Цикл
	//	
	//	ТекущаяСтрока   =  ИнтервалыШкалы[НомерСтроки];
	//	СледующаяСтрока =  ИнтервалыШкалы[НомерСтроки + 1];
	//	
	//	Если НЕ СледующаяСтрока.НижнийПорог = ТекущаяСтрока.ВерхнийПорог Тогда
	//		Отказ = Истина;
	//		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! Не верно заданы интервалы шкалы.");
	//	КонецЕсли;
	//			
	//	
	//КонецЦикла;
		
КонецПроцедуры
