
&НаКлиенте
Процедура СотрудникиСотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(ТекущаяДата(), ЭтаФорма, СтандартнаяОбработка, Истина, ?(ЗначениеЗаполнено(Элементы.Сотрудники.ТекущиеДанные.Сотрудник), KPI_ОбщегоНазначенияСервер.ПолучитьСтруктуруКомпанииПоСотруднику(Элементы.Сотрудники.ТекущиеДанные.Сотрудник), Неопределено));
	
	Если Не ОбъектУправления = Неопределено Тогда
		Элементы.Сотрудники.ТекущиеДанные.Сотрудник = ОбъектУправления.Сотрудник;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	Если Объект.Сотрудники.Итог("Вес") <> 100 Тогда
		Предупреждение("Общий вес должен быть равен 100%!");
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры
