
&НаКлиенте
Процедура ЗаполнитьТекущимиНачислениями(Команда)
	
	 ЗаполнитьТекущимиНачислениямиСервер();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТекущимиНачислениямиСервер()
	
	ПлановыеНачисления = KPI_ИнтерфейсСервер.СрезПлановыхНачисленийОбъектаУправления(Объект.Дата,Объект.ОбъектУправления);
	Объект.НачисленияСотрудника.Загрузить(ПлановыеНачисления);	
	
КонецПроцедуры

&НаКлиенте
Процедура ОбъектУправленияНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОписаниеОбъектаУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата,
	Элемент,СтандартнаяОбработка,,Объект.ОбъектУправления);
	
	Если ТипЗнч(ОписаниеОбъектаУправления) = Тип("Структура") Тогда
		
		ЭтаФорма.ПредставлениеОбъектаУправления = ОписаниеОбъектаУправления.СтруктураКомпанииПредставление;
		Объект.ОбъектУправления                 = ОписаниеОбъектаУправления.Сотрудник;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПредставлениеОбъектаУправления = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(
														Объект.ОбъектУправления.СтруктураКомпании,Объект.Дата);
	
КонецПроцедуры
