
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	////Вставить содержимое обработчика.
	//ПараметрыФормы = Новый Структура("");
	//ОткрытьФорму("Обработка.KPI_ВиджетСтандарты.Форма", ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	//	
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура("");
	ПараметрыФормы.Вставить("НаименованиеПанели","Оценки объекта управления");	
	KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПанельВиджетов","Форма",ПараметрыФормы, ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
КонецПроцедуры
