
&НаКлиенте
Процедура ПередатьОтбор(Команда)
	
	ОповеститьОВыборе(Отчет.КомпоновщикНастроек);
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	КомпоновщикНастроек  = Неопределено;
	
	Если Параметры.Свойство("КомпоновщикНастроек",КомпоновщикНастроек) Тогда
         Отчет.КомпоновщикНастроек.ЗагрузитьНастройки(Параметры.КомпоновщикНастроек.Настройки);		
	КонецЕсли;
	
	ЭтаФорма.ЗакрыватьПриВыборе = Ложь;
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, СтандартнаяОбработка)
	
	
	СтандартнаяОбработка          = Ложь;
	ЭтаФорма.ВариантМодифицирован = Ложь;
	
КонецПроцедуры
