
&НаКлиенте
Процедура СотрудникНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	//Если Не ЗначениеЗаполнено(Объект.Филиал) Тогда
	//	Сообщить("Выбирите филиал");
	//	Возврат;
	//КонецЕсли;
	
	//СтандартнаяОбработка = Ложь;
	//ФормаВыбора = ОткрытьФорму("Справочник.KPI_Сотрудники.ФормаВыбора", Новый Структура("Филиал", Объект.Филиал), Элемент);
	
	ОписаниеСтруктуры = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата,,СтандартнаяОбработка,,Объект.Сотрудник);
	
	Если НЕ ОписаниеСтруктуры = Неопределено Тогда
		Объект.Сотрудник = ОписаниеСтруктуры.Сотрудник;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Не ЗначениеЗаполнено(Объект.Ответственный) Тогда
		Объект.Ответственный = ПараметрыСеанса.KPI_ТекущийСотрудник.СтруктураКомпании;
	КонецЕсли;
	
КонецПроцедуры
