//Процедура получает список оценок по шкале
//Параметры
// ШкалаОценок - тип СправочникСсылка.KPI_ШкалыОценок
//Возвращаемое значение
// тип массив, элементы массива СправочникСсылка.KPI_ВидыОценок
Функция ОценкиСтандарта(Стандарт) Экспорт
	
	 ШкалаОценок = Стандарт.ШкалаОценок;
	
	 ТекстЗапроса = "ВЫБРАТЬ
	 |	KPI_ВидыОценок.Ссылка КАК Оценка
	 |ИЗ
	 |	Справочник.KPI_ВидыОценок КАК KPI_ВидыОценок
	 |ГДЕ
	 |	KPI_ВидыОценок.Владелец = &ШкалаОценок";
	 
	 Запрос = Новый Запрос(ТекстЗапроса);
	 Запрос.УстановитьПараметр("ШкалаОценок",ШкалаОценок);
	 
	 Оценки = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Оценка");
	 
	 Возврат Оценки;
	
КонецФункции