//Функция возвращает значение показателя расчета
//
//Параметры:
// Сотрудник            - тип СправочникСсылка.KPI_Сотрудники, сотрудник по котрому происходит расчет
// ПоказательНачисления - тип СправочникСсылка.KPI_ПоказателиНачислений, рассчитываемый показатель
// ПланыФакты           - тип ТаблицаЗначений, планы/факты
// АдресПланФакты       - тип Строка, адрес таблицы план/факты во временном хранилище 
//
//Возвращаемое значение:
//  Плановые начисления объектов управления - тип таблица значений
//
Функция ПолучитьЗначениеПоказателяНачисления(Сотрудник, ПоказательНачисления, ПланыФакты, АдресПланФакты) Экспорт	
	
	ЗначениеПоказателя = 0;
	КритерийПоискаСотрудник     = Новый Структура("СтруктураКомпании, ЦелевойПоказатель", Сотрудник.СтруктураКомпании);
	
	Если ПоказательНачисления = Справочники.KPI_ПоказателиРасчета.ИтоговыйКПР Тогда
		
		КритерийПоиска = Новый Структура("СтруктураКомпании", Сотрудник.СтруктураКомпании);
		Для Каждого Стр Из ПланыФакты.НайтиСтроки(КритерийПоиска) Цикл
			ЗначениеПоказателя = ЗначениеПоказателя + Стр.КПР;
		КонецЦикла; 
		
		Возврат ЗначениеПоказателя;
	КонецЕсли;
	
	Запрос = Новый Запрос();
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ЕСТЬNULL(KPI_ЗначенияПоказателей.Значение, 0) КАК Значение
	|ИЗ
	|	РегистрСведений.KPI_ЗначенияПоказателей КАК KPI_ЗначенияПоказателей
	|ГДЕ
	|	KPI_ЗначенияПоказателей.Показатель = &Показатель
	|	И KPI_ЗначенияПоказателей.Сотрудник = &Сотрудник";
	
	Запрос.УстановитьПараметр("Показатель", ПоказательНачисления);
	Запрос.УстановитьПараметр("Сотрудник",  Сотрудник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ЗначениеПоказателя = Выборка.Значение;
	КонецЕсли;
	
	Возврат ЗначениеПоказателя;	
	
КонецФункции