
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("РодительПодразделения",ЭтаФорма.РодительПодразделения);
	Параметры.Свойство("Период",ЭтаФорма.Период);
	
	ДеревоКомпании.Параметры.УстановитьЗначениеПараметра("РодительПодразделения",ЭтаФорма.РодительПодразделения);
	ДеревоКомпании.Параметры.УстановитьЗначениеПараметра("Период",ЭтаФорма.Период);	
	
КонецПроцедуры

&НаСервере
Функция ВостановитьЭлементСтруктуры(ЭлементСтруктуры,Родитель,Период)
	
	ЭлементВостановленн = РегистрыСведений.KPI_СтруктураКомпании.ВоостановитьЭлементСтруктурыКомпании(ЭлементСтруктуры,Родитель,Период);
	
	Если ЭлементВостановленн Тогда
		Элементы.ДеревоКомпании.Обновить();
	КонецЕсли;
	
	Возврат ЭлементВостановленн;
	
КонецФункции

&НаКлиенте
Процедура ВостановитьЭлемент(Команда)
	
	ТекущиеДанные = Элементы.ДеревоКомпании.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда
		ЭлементВостановлен = ВостановитьЭлементСтруктуры(ТекущиеДанные.СтруктураКомпании,
		ЭтаФорма.РодительПодразделения,ТекущиеДанные.Период);
		Если ЭлементВостановлен Тогда 
			Оповестить("ИзменениеСтруктурыКомпании");
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
