
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//Вставить содержимое обработчика.
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("НаименованиеПанели","Тактическая панель");
	
	//Открытая обработка
	//ОткрытьФорму("Обработка.KPI_ПанельKPI.Форма",ПараметрыФормы,ПараметрыВыполненияКоманды.Источник, ПараметрыВыполненияКоманды.Уникальность, ПараметрыВыполненияКоманды.Окно);
	
	//Закрытая обработка
	//KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПанельKPI");
	
	KPI_ИнтерфейсКлиент.ОткрытьФормуЗащищенногоОбъекта("KPI_ПанельВиджетов","Форма",ПараметрыФормы,,Новый УникальныйИдентификатор);
	
КонецПроцедуры
