
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	ОбработкаУдаленияПроведения(Отказ);
	
	Для каждого Строка Из Сотрудники Цикл
		
		//Проверка на занятость должности сотрудником
		Если Не ЗначениеЗаполнено(Строка.Сотрудник) Тогда      			
			Сообщить("Сотрудник " + Строка.Сотрудник + " не занимает должность """ + Строка.Сотрудник.СтруктураКомпании.Должность + """ на данную дату");
			УдалитьПроведение = Истина;			
		Иначе
			//Проверка на возможность проведения задним числом
			Если НачалоДня(Дата) >= НачалоДня(ТекущаяДата()) Или KPI_ОбщегоНазначенияСервер.ПроверкаНаВозможностьПроведенияЗаднимЧислом(Строка.Сотрудник.СтруктураКомпании, Дата, Истина) Тогда
				УдалитьПроведение = Ложь;
			Иначе
				УдалитьПроведение = Истина;
				Сообщить("Проведение задним числом невозможно, т.к. существуют документы снятия с должности """ + Строка.Сотрудник.СтруктураКомпании.Должность + """ на более позднюю дату (Строка №" + Строка.НомерСтроки + ")");
			КонецЕсли;
		КонецЕсли;	
		
		//Делаем запись об увольнении сотрудника
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период            = Дата-1;
		Запись.Прочитать();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Уволен            = Истина;
		Запись.Сотрудник         = Строка.Сотрудник;
		Запись.Период            = Дата-1;
		Запись.Записать();  
		
		//Делаем запись о пустом структурном подразделении
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период            = Дата;
		Запись.Уволен            = Ложь;
		Запись.Период            = Дата;
		Запись.Записать();   	
		
	КонецЦикла;	
	
	Если УдалитьПроведение Тогда
		ЭтотОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЕсли;	
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Для каждого Строка Из Сотрудники Цикл
		
		//Удаляем записи об увольнении сотрудника
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период = Дата-1;
		Запись.Прочитать();
		Запись.Удалить();  
		
		//Удаляем записи о пустом структурном подразделении
		Запись = РегистрыСведений.KPI_СтруктураКомпании.СоздатьМенеджерЗаписи();
		Запись.СтруктураКомпании = Строка.Сотрудник.СтруктураКомпании;
		Запись.Период = Дата;
		Запись.Прочитать();
		Запись.Удалить();
		
	КонецЦикла;		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
		Если ДанныеЗаполнения.Свойство("Сотрудник") Тогда
			нСтр = Сотрудники.Добавить();
			нСтр.Сотрудник = ДанныеЗаполнения.Сотрудник;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Ответственный) Тогда
		Ответственный = ПараметрыСеанса.KPI_ТекущийСотрудник.СтруктураКомпании;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Дата) Тогда
		Дата = ТекущаяДата();
	КонецЕсли;
	
КонецПроцедуры
