
&НаКлиенте
Процедура СтруктураЭлементСтруктурыНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ЭтаФорма.ТекущийЭлемент.ТекущиеДанные.ЭлементСтруктуры = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Параметры.Дата, ЭтаФорма, СтандартнаяОбработка, ?(Параметры.Ключ = "ВзаимосвязьЦелей", Ложь, Истина));
КонецПроцедуры


&НаКлиенте
Процедура ОК(Команда)
	Для Каждого Стр Из СтруктураКомпании Цикл
		СтруктЭлем = Новый Структура("ЭлементСтруктуры", Стр.ЭлементСтруктуры);
		ОдинакЭлем = СтруктураКомпании.НайтиСтроки(СтруктЭлем);
		Если ОдинакЭлем.Количество() > 1 Тогда
			Сообщить("Элементы списка не должны повторяться: " + Стр.ЭлементСтруктуры);
			Возврат;
		КонецЕсли;
	КонецЦикла;	
	
	СЗ = Новый СписокЗначений;
	
	Для каждого Стр Из СтруктураКомпании Цикл
		СЗ.Добавить(Стр.ЭлементСтруктуры);
	КонецЦикла;
	
	СтруктураИзСЗ = Новый Структура;
	СтруктураИзСЗ.Вставить("Форма", "KPI_ФормаСпискаСтруктураКомпании");
	СтруктураИзСЗ.Вставить("СЗ", СЗ);
	СтруктураИзСЗ.Вставить("Ключ", ЭтаФорма.Параметры.Ключ);
	
	ОповеститьОВыборе(СтруктураИзСЗ);
КонецПроцедуры


&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Ключ = "ВзаимосвязьЦелей" Тогда
		ЭтаФорма.Параметры.Дата = Параметры.Дата;
	Иначе
		ЭтаФорма.Параметры.Дата = ТекущаяДата();
	КонецЕсли;
	
	СЗ = Новый СписокЗначений;
	СЗ = Параметры.Список;
	
	Для каждого Элем Из СЗ Цикл
		НовСтр = СтруктураКомпании.Добавить();
		НовСтр.ЭлементСтруктуры = Справочники.KPI_СтруктураКомпании.НайтиПоНаименованию(Элем.Значение, Истина);
	КонецЦикла;
КонецПроцедуры

