//Функция возвращает представление ключа аналитики
//Параметры:
// КлючАналитики - тип СправочникСсылка.КлючАналитики
//Возвращаемое значение:
// Представление ключа аналитики, тип строка
Функция ПредставлениеКлючаАналитики(КлючАналитики) Экспорт
	
	Представление = "";
	Для i = 1 по 5 Цикл
		Аналитика = КлючАналитики["Аналитика" + i];
		Если ЗначениеЗаполнено(Аналитика) Тогда
			Представление = Представление + ?(Представление = "", "", Символы.ПС) + "Аналитика "+ i + " :  " + Аналитика;
		КонецЕсли;
	КонецЦикла;  

	Возврат Представление;
	
КонецФункции
