
&НаКлиенте
Процедура ОтборШкалаОценокПриИзменении(Элемент)
	
	KPI_ИнтерфейсКлиентСервер.ИзменитьЭлементОтбораСписка(Список,"Владелец",
														ЭтаФорма.ОтборШкалаОценок, ЗначениеЗаполнено(ЭтаФорма.ОтборШкалаОценок));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	Если Не ЗначениеЗаполнено(ЭтаФорма.ОтборШкалаОценок) Тогда
		Отказ = Истина;
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка. Не указана шкала оценок.");
	КонецЕсли;
	
КонецПроцедуры
