
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОтборСписка = Список.Отбор;
	Если Параметры.Свойство("Филиал") Тогда
		Если ЗначениеЗаполнено(Параметры.Филиал) Тогда
			ЭлементОтбора = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
			ЭлементОтбора.ЛевоеЗначение  = Новый ПолеКомпоновкиДанных("СтруктураКомпании.Филиал");	
			ЭлементОтбора.ВидСравнения   = ВидСравненияКомпоновкиДанных.Равно;
			ЭлементОтбора.Использование  = Истина;
			ЭлементОтбора.ПравоеЗначение = Параметры.Филиал;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
