
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ДокументРезультат.Очистить();

	ПараметрыДанных   = КомпоновщикНастроек.Настройки.ПараметрыДанных;
	Период            = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("Период")).Значение;
	ГраницыПериода    = KPI_ОбщегоНазначенияСервер.ГраницыПериода(период,Перечисления.KPI_ПериодичностьПланирования.Месяц);
	СтруктураКомпании = ПараметрыДанных.НайтиЗначениеПараметра(Новый ПараметрКомпоновкиДанных("ОбъектУправления")).Значение;
	Сотрудник = KPI_ОбщегоНазначенияСервер.ПолучитьСотрудникаПоСтруктуреКомпанииНаДату(СтруктураКомпании,Период);
	
	ПараметрыДанных.УстановитьЗначениеПараметра("НачалоПериода" , ГраницыПериода.НачалоПериода);
	ПараметрыДанных.УстановитьЗначениеПараметра("КонецПериода"  , ГраницыПериода.КонецПериода);
	ПараметрыДанных.УстановитьЗначениеПараметра("Сотрудник"     , Сотрудник);
	
	Компоновщик     = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = Компоновщик.Выполнить(СхемаКомпоновкиДанных,КомпоновщикНастроек.Настройки,ДанныеРасшифровки);
	
	ПроцессорКомпоновки = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновки.Инициализировать(МакетКомпоновки,,ДанныеРасшифровки);
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;	
	ПроцессорВывода.УстановитьДокумент(ДокументРезультат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновки);
	
КонецПроцедуры
