
&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	KPI_ОбщегоНазначения.ПроверитьВозможностьИзмененияДаты(Объект.Сотрудники, СтандартнаяОбработка);		
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	//Проверка на задвоение вакантных должностей
	Для каждого Строка Из Объект.Сотрудники Цикл
		Отбор = Новый Структура;
		Отбор.Вставить("СтруктураКомпании", Строка.СтруктураКомпании);
		НайденныеСтроки = Объект.Сотрудники.НайтиСтроки(Отбор);
		Если НайденныеСтроки.Количество() > 1 Тогда
			Сообщить("Повторяющийся элемент в строке №" + Строка.НомерСтроки);
			Отказ = Истина;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПлановыеНачисления(Команда)
	
	Если Объект.ПлановыеНачисления.Количество() Тогда 
		Если Вопрос("Текущие начисления будут удалены
			|Вы уверены?", РежимДиалогаВопрос.ДаНет) = КодВозвратаДиалога.Нет Тогда
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	ЗаполнитьПлановыеНачисленияНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановыеНачисленияНаСервере()
	
	Начисления = Справочники.KPI_Должности.ПлановыеНачисления(Объект.Сотрудники.Выгрузить());
	Объект.ПлановыеНачисления.Загрузить(Начисления);
	 	 
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиСтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПлановыеНачисленияСтруктурноеПодразделениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СотрудникиПредставлениеПользователяНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;	
	
КонецПроцедуры






