
&НаКлиенте
Перем ГиперСсылкаВводаТекст;



/////////////////////////////////
//     кнопки (1-я строка)     //
/////////////////////////////////

&НаКлиенте
Процедура КнопкаЦЗ(Команда)
	ТелоФормулы = ТелоФормулы + "[ЦЗ]";
КонецПроцедуры


&НаКлиенте
Процедура КнопкаФЗ(Команда)
	ТелоФормулы = ТелоФормулы + "[ФЗ]";
КонецПроцедуры


&НаКлиенте
Процедура КнопкаПЗ(Команда)
	ТелоФормулы = ТелоФормулы + "[ПЗ]";
КонецПроцедуры


&НаКлиенте
Процедура КнопкаМЗ(Команда)
	ТелоФормулы = ТелоФормулы + "[МЗ]";
КонецПроцедуры


/////////////////////////////////
//     кнопки (2-я строка)     //
/////////////////////////////////

&НаКлиенте
Процедура Команда1(Команда)
	ТелоФормулы = ТелоФормулы + "1";
КонецПроцедуры


&НаКлиенте
Процедура Команда2(Команда)
	ТелоФормулы = ТелоФормулы + "2";
КонецПроцедуры


&НаКлиенте
Процедура Команда3(Команда)
	ТелоФормулы = ТелоФормулы + "3";
КонецПроцедуры


&НаКлиенте
Процедура Команда4(Команда)
	ТелоФормулы = ТелоФормулы + "4";
КонецПроцедуры


&НаКлиенте
Процедура Команда5(Команда)
	ТелоФормулы = ТелоФормулы + "5";
КонецПроцедуры


&НаКлиенте
Процедура Команда6(Команда)
	ТелоФормулы = ТелоФормулы + "6";
КонецПроцедуры


&НаКлиенте
Процедура Команда7(Команда)
	ТелоФормулы = ТелоФормулы + "7";
КонецПроцедуры


&НаКлиенте
Процедура Команда8(Команда)
	ТелоФормулы = ТелоФормулы + "8";
КонецПроцедуры


&НаКлиенте
Процедура Команда9(Команда)
	ТелоФормулы = ТелоФормулы + "9";
КонецПроцедуры


&НаКлиенте
Процедура Команда0(Команда)
	ТелоФормулы = ТелоФормулы + "0";
КонецПроцедуры


&НаКлиенте
Процедура КомандаСтеретьСимвол(Команда)
	Стр = ТелоФормулы;
	
	Если Прав(Стр, 1) = "]" Тогда
		Пока Прав(Стр, 1) <> "[" Цикл
			ТелоФормулы = Лев(Стр, СтрДлина(Стр) - 1);
			Стр = ТелоФормулы;
		КонецЦикла;
	КонецЕсли;
	
	ТелоФормулы = Лев(Стр, СтрДлина(Стр) - 1);
КонецПроцедуры


/////////////////////////////////
//     кнопки (3-я строка)     //
/////////////////////////////////

&НаКлиенте
Процедура КомандаПлюс(Команда)
	ТелоФормулы = ТелоФормулы + "+";
КонецПроцедуры


&НаКлиенте
Процедура КомандаМинус(Команда)
	ТелоФормулы = ТелоФормулы + "-";
КонецПроцедуры


&НаКлиенте
Процедура КомандаУмножить(Команда)
	ТелоФормулы = ТелоФормулы + "*";
КонецПроцедуры


&НаКлиенте
Процедура КомандаРазделить(Команда)
	ТелоФормулы = ТелоФормулы + "/";
КонецПроцедуры


&НаКлиенте
Процедура КомандаТочка(Команда)
	ТелоФормулы = ТелоФормулы + ".";
КонецПроцедуры


&НаКлиенте
Процедура КомандаЗапятая(Команда)
	ТелоФормулы = ТелоФормулы + ",";
КонецПроцедуры


&НаКлиенте
Процедура КомандаОстатокОтДеления(Команда)
	ТелоФормулы = ТелоФормулы + "%";
КонецПроцедуры


/////////////////////////////////
//     кнопки (4-я строка)     //
/////////////////////////////////

&НаКлиенте
Процедура КомандаВопрос(Команда)
	ТелоФормулы = ТелоФормулы + "?";
КонецПроцедуры


&НаКлиенте
Процедура КомандаСкобкаЛевая(Команда)
	ТелоФормулы = ТелоФормулы + "(";
КонецПроцедуры


&НаКлиенте
Процедура КомандаСкобкаПравая(Команда)
	ТелоФормулы = ТелоФормулы + ")";
КонецПроцедуры


&НаКлиенте
Процедура КомандаМеньше(Команда)
	ТелоФормулы = ТелоФормулы + "<";
КонецПроцедуры


&НаКлиенте
Процедура КомандаБольше(Команда)
	ТелоФормулы = ТелоФормулы + ">";
КонецПроцедуры


&НаКлиенте
Процедура КомандаРавно(Команда)
	ТелоФормулы = ТелоФормулы + "=";
КонецПроцедуры


&НаКлиенте
Процедура КомандаСтеретьВсе(Команда)
	ТелоФормулы = "";
КонецПроцедуры


/////////////////////////////////
/////////////////////////////////


&НаКлиенте
Процедура КомандаОК(Команда)
	Если ПроверитьФормулу() Тогда
		Структура = Новый Структура;
		Структура.Вставить("Шкала", Шкала);
		Структура.Вставить("Формула", ТелоФормулы);
		ОповеститьОВыборе(Структура);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Функция ПроверитьФормулу()
	КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
	
	ФормулаКорректна = КриптоМодуль.ПроверитьФормулу(ТелоФормулы);
	 
	Возврат ФормулаКорректна;
КонецФункции


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ТекущийВладелец = ЭтаФорма.ВладелецФормы;
	Если ТипЗнч(ТекущийВладелец) = Тип("УправляемаяФорма") Тогда
		Шкала = ТекущийВладелец.Объект.Шкала;
		
		Если ТекущийВладелец.Объект.Формула = ГиперСсылкаВводаТекст Тогда
			ТелоФормулы = "";
		Иначе 
			ТелоФормулы = ТекущийВладелец.Объект.Формула;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры



ГиперСсылкаВводаТекст = "Введите формулу";

