
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр KPI_СоответствиеЦелейИПоказателей
	Движения.KPI_СоответствиеЦелейИПоказателей.Записывать = Истина;
	Для Каждого ТекСтрокаСписокПоказателей Из СписокПоказателей Цикл
		Движение = Движения.KPI_СоответствиеЦелейИПоказателей.Добавить();
		Движение.Период = Дата;
		Движение.Цель = ТекСтрокаСписокПоказателей.Цель;
		Движение.ЦелевойПоказатель = ТекСтрокаСписокПоказателей.ЦелевойПоказатель;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
