Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр KPI_РабочееВремяСотрудников Приход	
	
	Движения.KPI_РабочееВремяСотрудников.Записывать = Истина;
	Движения.KPI_РабочееВремяСотрудников.Записать();
	
	ВыборкаСотрудник = KPI_ИнтерфейсВызовСервера.РабочееВремяСотрудников(НачалоПериода,КонецПериода,Сотрудник);
				
	Пока ВыборкаСотрудник.Следующий() Цикл
		ВыборкаРабочиеЧасы = ВыборкаСотрудник.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока  ВыборкаРабочиеЧасы.Следующий() Цикл
			Движение             = Движения.KPI_РабочееВремяСотрудников.Добавить();
			Движение.Период      = ВыборкаРабочиеЧасы.Дата;
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Сотрудник   = ВыборкаРабочиеЧасы.Сотрудник;
			Движение.Часов       = ВыборкаРабочиеЧасы.Часы;
			Движение.Явка        = Ложь;
		КонецЦикла;
	КонецЦикла;
			
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	КонецПериода = КонецДня(КонецПериода);
	
КонецПроцедуры
