
&НаКлиенте
Процедура Сохранить(Команда)
	
	ЗаписатьЗначения();
	
	Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Предупреждение("Для принятия изменений необходимо перезапустить программу");
	КонецЕсли;
	
	ЭтаФорма.Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	ЭтаФорма.Закрыть(Истина);
	
КонецПроцедуры

&НаСервере
Процедура ВосстановитьЗначения()
	
	АдресСервераСЛК = Константы.KPI_АдресСервераСЛК.Получить();
	ПортСервераСЛК  = Константы.KPI_ПортСервераСЛК.Получить();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьЗначения()
	
	Константы.KPI_АдресСервераСЛК.Установить(СокрЛП(АдресСервераСЛК));
	Константы.KPI_ПортСервераСЛК.Установить(ПортСервераСЛК);
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ВосстановитьЗначения();
	
	ОписаниеОшибки = Параметры.ОписаниеОшибки;
	
	Если Не ЗначениеЗаполнено(ОписаниеОшибки) Тогда
		Элементы.ОписаниеОшибки.Видимость = Ложь;
	КонецЕсли;
	
	Если Не РольДоступна("ПолныеПрава") Тогда
		Сообщить("Для настройки соединения с сервером СЛК необходимы полные права. Действие отменено.");
		Отказ = Истина;	
	КонецЕсли;
	
КонецПроцедуры
