//Функция получает значение ресурса с учетом матрицы распределения
//Параметры
// ПланФакты            - тип ТаблицаЗначений
// МатрицаРаспределения - тип СправочникСсылка.KPI_МатрицыРаспределения 
// ОтборПоказатели      - тип структура
//		Элементы:
//			ЦелевойПоказатель    - тип СправочникСсылка.KPI_ЦелевыеПоказатели,
//			Аналитика1           - тип произвольный,
//			Аналитика2           - тип произвольный,
//			Аналитика3           - тип произвольный,
//			Аналитика4           - тип произвольный,
//			Аналитика5           - тип произвольный,
// ТипРесурса           - тип строка (Представление ресурса (факт,вес и т.д.)
// Шкала                - тип СправочникСсылка.KPI_Шкала
//Возвращаемое значение
// ЗначениеШкалы        - тип число(значение ресурса по матрице распределения, с учетом интервалы шкалы)
Функция ЗначениеРесурсаМатрицыРаспределения(АдресПланФакты, МатрицаРаспределения, ОтборПоказатели, ТипРесурса, Шкала) Экспорт
	
	ЗначениеМатрицы = 0;
	ПланыФакты = ПолучитьИзВременногоХранилища(АдресПланФакты);
	
	Для Каждого Стр Из МатрицаРаспределения.Сотрудники Цикл
		
		ОтборПоказатели.Вставить("СтруктураКомпании", Стр.Сотрудник.СтруктураКомпании);
		
		СтрокиМатрицы = ПланыФакты.НайтиСтроки(ОтборПоказатели);
		Если ЗначениеЗаполнено(СтрокиМатрицы) Тогда
			ЗначениеПоВесу = СтрокиМатрицы[0][ТипРесурса] * Стр.Вес / 100;                                           
			ЗначениеМатрицы = ЗначениеМатрицы + ЗначениеПоВесу;                          
		КонецЕсли;
		
	КонецЦикла;
	
	ЗначениеШкалы = Справочники.KPI_Шкалы.ЗначениеРесурсаЦелевогоПоказателяПоШкале(Шкала, ЗначениеМатрицы);
	
	Возврат ЗначениеШкалы;
	
КонецФункции

//Функция получает представление типа ресурса ЦелевогоПоказателя
//Параметры 
// ТипРесурса               - тип ПеречислениеСсылка.KPI_РесурсыЦелевогоПоказателя
//Возвращаемое значение
// ПредставлениеТипаРесурса - тип строка
Функция ПредставленияРесурсаЦелевогоПоказателя(ТипРесурса)  Экспорт
	
	ПредставленияРесурсаЦП  = Новый Соответствие;
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.Факт             , "Факт");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.Вес              , "Вес");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.КПР              , "КПР");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.План             , "План");
	ПредставленияРесурсаЦП.Вставить(Перечисления.KPI_РесурсыЦелевогоПоказателя.ПроцентВыполнения, "ПроцентВыполнения");
	
	Возврат ПредставленияРесурсаЦП.Получить(ТипРесурса);
	
КонецФункции

//Функция получает КлючАналитики 
//Параметры
// Аналитика1, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика2, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика3, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика4, 				тип ЛюбаяСсылка, строка, число, дата, булево
// Аналитика5, 				тип ЛюбаяСсылка, строка, число, дата, булево
//Возвращаемое значение
// СправочникСсылка.KPI_КлючиАналитики
Функция КлючАналитики (Аналитика1 = Неопределено, Аналитика2 = Неопределено, Аналитика3 = Неопределено, Аналитика4 = Неопределено, Аналитика5 = Неопределено) Экспорт
	
	КриптоМодуль = KPI_ОбщегоНазначенияСервер.ПолучитьКриптоМодуль();
	Возврат КриптоМодуль.КлючАналитики(Аналитика1, Аналитика2, Аналитика3, Аналитика4, Аналитика5);					   
	
КонецФункции

//Функция возвращает представление ключа аналитики
//Параметры:
// КлючАналитики - тип СправочникСсылка.КлючАналитики
//Возвращаемое значение:
// Представление ключа аналитики, тип строка
Функция ПредставлениеКлючаАналитики(КлючАналитики) Экспорт
	
	Возврат Справочники.KPI_КлючиАналитики.ПредставлениеКлючаАналитики(КлючАналитики);
	
КонецФункции

