
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Владелец"            ,Владелец);
	Параметры.Свойство("ГруппаПанелей"       ,ГруппаПанелей);
	Параметры.Свойство("НаименованиеПанели"  ,НаименованиеПанели);
	Параметры.Свойство("ИдентификаторВиджета",ИдентификаторВиджета);
	Параметры.Свойство("ТипВиджета"          ,ТипВиджета);

	Исключения = Новый Массив;
	Исключения.Добавить(Метаданные.Отчеты.KPI_ФормированиеСпискаСмартЗадач.Имя);
	
	Для Каждого ТипОтчета из Метаданные.Отчеты Цикл
		
		Если Исключения.Найти(ТипОтчета.Имя) = Неопределено Тогда
			ЗаполнитьЗначенияСвойств(ДоступныеОтчеты.Добавить(),ТипОтчета);
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры

&НаКлиенте
Процедура ДоступныеОтчетыВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОповеститьПанель();

КонецПроцедуры

&НаКлиенте
Процедура ВыбратьОтчет(Команда)
	
	ОповеститьПанель();	
	
КонецПроцедуры

&НаКлиенте
Процедура ОповеститьПанель()

	ТекущиеДанные = Элементы.ДоступныеОтчеты.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! Не выбран отчет.");
	КонецЕсли;
	
	ПараметрыОповещения = Новый Структура;
	ПараметрыОповещения.Вставить("Владелец"            ,Владелец);
	ПараметрыОповещения.Вставить("ГруппаПанелей"       ,ГруппаПанелей);
	ПараметрыОповещения.Вставить("НаименованиеПанели"  ,НаименованиеПанели);
	ПараметрыОповещения.Вставить("ТипВиджета"          ,ТипВиджета);
	ПараметрыОповещения.Вставить("ИдентификаторВиджета",ИдентификаторВиджета);
	ПараметрыОповещения.Вставить("ИмяОтчета"           ,ТекущиеДанные.Имя);
	Оповестить("ПанельВиджетовОткрытьОтчет",ПараметрыОповещения);
	Закрыть();
	
КонецПроцедуры
