&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	
	ТипыАналитики = Метаданные.Справочники;
	
	Для Каждого Тип Из ТипыАналитики Цикл
		НовСтр = ЭтаФорма.ТЗ.Добавить();
		НовСтр.Картинка = БиблиотекаКартинок.Справочник;
		НовСтр.ИмяСпр = Тип.Имя;
		НовСтр.Синоним = Тип.Синоним;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВозвратитьЗначение(ТекЗнач, ТекПредст)
	
	ВыбранноеЗначение = Новый Структура;
	ВыбранноеЗначение.Вставить("Значение", ТекЗнач);
	ВыбранноеЗначение.Вставить("Представление", ТекПредст);
	ВыбранноеЗначение.Вставить("Ключ", ЭтаФорма.Параметры.Ключ);
	
	ОповеститьОВыборе(ВыбранноеЗначение);
	
КонецПроцедуры

&НаКлиенте
Процедура ТЗВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВозвратитьЗначение(ЭтаФорма.ТЗ.Получить(ВыбраннаяСтрока).Синоним, ЭтаФорма.ТЗ.Получить(ВыбраннаяСтрока).ИмяСпр);
	
КонецПроцедуры





