
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Элементы.СотрудникиКвалификация.Видимость = Объект.ИзменятьКвалификацию;
	ОбновитьПредставления();
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьПредставления()
	Для каждого Элемент Из Объект.Сотрудники Цикл
		 Элемент.СтараяДолжностьПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Элемент.СтараяДолжность, Объект.Дата);
		 Элемент.СтруктураКомпанииПредставление = KPI_ОбщегоНазначенияСервер.ПолучитьПредставлениеПоСтруктуреКомпанииНаДату(Элемент.СтруктураКомпании, Объект.Дата);
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура ИзменятьКвалификациюПриИзменении(Элемент)
	
	Элементы.СотрудникиКвалификация.Видимость = Объект.ИзменятьКвалификацию;
	
КонецПроцедуры


&НаКлиенте
Процедура ДатаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	KPI_ОбщегоНазначения.ПроверитьВозможностьИзмененияДаты(Объект.Сотрудники, СтандартнаяОбработка);	
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСтараяДолжностьНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Элементы.Сотрудники.ТекущиеДанные.СтараяДолжность = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСотрудникаНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка);	
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСтруктураКомпанииНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, Элемент, СтандартнаяОбработка);
	
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании);
	
	Если Не ОбъектУправления = Неопределено Тогда
		Если Не ОбъектУправления.Сотрудник = ПредопределенноеЗначение("Справочник.KPI_Сотрудники.ПустаяСсылка") Тогда
			Сообщить("Данная должность занята другим сотрудником");
			ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = Неопределено;
			ТекущийЭлемент.ТекущиеДанные.СтруктураКомпанииПредставление = Неопределено;
			Возврат;
		КонецЕсли;
		
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = ОбъектУправления.СтруктураКомпании;
		ТекущийЭлемент.ТекущиеДанные.СтруктураКомпанииПредставление = ОбъектУправления.СтруктураКомпанииПредставление;
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСтараяДолжностьПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОбъектУправления = KPI_ОбщегоНазначения.ОбработкаВыбораПолучитьСтруктуруКомпанииНаДату(Объект.Дата, ЭтаФорма, СтандартнаяОбработка, , ТекущийЭлемент.ТекущиеДанные.СтараяДолжность);
	
	Если Не ОбъектУправления = Неопределено Тогда
		Если ОбъектУправления.Сотрудник = ПредопределенноеЗначение("Справочник.KPI_Сотрудники.ПустаяСсылка") Тогда
			Сообщить("На данной должности нет сотрудника");
			ТекущийЭлемент.ТекущиеДанные.СтараяДолжность = Неопределено;
			ТекущийЭлемент.ТекущиеДанные.СтараяДолжностьПредставление = Неопределено;
			Возврат;
		КонецЕсли;
		
		ТекущийЭлемент.ТекущиеДанные.СтараяДолжность = ОбъектУправления.СтруктураКомпании;
		ТекущийЭлемент.ТекущиеДанные.СтараяДолжностьПредставление = ОбъектУправления.СтруктураКомпанииПредставление;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСтараяДолжностьПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	ТекущийЭлемент.ТекущиеДанные.СтараяДолжность = Неопределено;
КонецПроцедуры


//&НаКлиенте
//Процедура СотрудникиСтруктураКомпанииПредставлениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
//	
//КонецПроцедуры


&НаКлиенте
Процедура СотрудникиСтруктураКомпанииПредставлениеОчистка(Элемент, СтандартнаяОбработка)
	ТекущийЭлемент.ТекущиеДанные.СтруктураКомпании = Неопределено;
КонецПроцедуры


&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	ОбновитьПредставления();
КонецПроцедуры


&НаКлиенте
Процедура ЗаполнитьПлановымиНачислениями(Команда)
	
	ЗаполнитьПлановымиНачислениямиСервер();	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПлановымиНачислениямиСервер()
	
	Начисления = Справочники.KPI_Должности.ПлановыеНачисления(Объект.Сотрудники.Выгрузить());
	Объект.ПлановыеНачисления.Загрузить(Начисления);
	
КонецПроцедуры


&НаКлиенте
Процедура СотрудникиНоваяДолжностьПредставлениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ТекущиеДанные = Элементы.Сотрудники.ТекущиеДанные;
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		 ТекущиеДанные.СтруктураКомпании           = ВыбранноеЗначение.СтруктураКомпании;
		 ТекущиеДанные.СтруктураКомпанииПредставление = ВыбранноеЗначение.СтруктураКомпанииПредставление;
	 КонецЕсли;
	
КонецПроцедуры

