//Функция получает плановые начисления по объектам управления
//Параметры:
// ОбъектыУправления - тип массив, тип элементов массива СправочникСсылка.KPI_СтруктураКомпании;
//Возвращаемое значение:
//  Плановые начисления объектов управления - тип таблица значений
Функция ПлановыеНачисления(ОбъектыУправления) Экспорт
	
	ТекстЗапроса = "ВЫБРАТЬ
	|	ОбъектыУправления.СтруктураКомпании,
	|	ОбъектыУправления.Должность
	|ПОМЕСТИТЬ ОбъектыУправления
	|ИЗ
	|	&ТЗ КАК ОбъектыУправления
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ОбъектыУправления.СтруктураКомпании,
	|	KPI_ДолжностиПлановыеНачисления.Ссылка,
	|	KPI_ДолжностиПлановыеНачисления.Начисление,
	|	KPI_ДолжностиПлановыеНачисления.Сумма
	|ИЗ
	|	ОбъектыУправления КАК ОбъектыУправления
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.KPI_Должности.ПлановыеНачисления КАК KPI_ДолжностиПлановыеНачисления
	|		ПО ОбъектыУправления.Должность = KPI_ДолжностиПлановыеНачисления.Ссылка
	|ГДЕ
	|	KPI_ДолжностиПлановыеНачисления.Ссылка В(&Должности)";
	
	Запрос = Новый Запрос(ТекстЗапроса);  
		
	ОбъектыУправления.Колонки.Добавить("Должность", Новый ОписаниеТипов("СправочникСсылка.KPI_Должности"));
	
	Для каждого Элемент Из ОбъектыУправления Цикл
		Элемент.Должность = Элемент.СтруктураКомпании.Должность;
	КонецЦикла;
	
	Запрос.УстановитьПараметр("ТЗ", ОбъектыУправления);
	Запрос.УстановитьПараметр("Должности", ОбъектыУправления.ВыгрузитьКолонку("Должность"));
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции