
Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр KPI_РабочееВремяСотрудников Приход	
	нМесяц = Месяц(Дата);
	нГод   = Год(Дата);
	КоличествоДнейМесяца = KPI_ИнтерфейсКлиентСервер.КоличествоДнейМесяца(Дата);
	Движения.KPI_РабочееВремяСотрудников.Записывать = Истина;
	
	Для Каждого ТекСтрока Из ОтработанноеВремя Цикл
		
		Для НомерДня = 1 по КоличествоДнейМесяца Цикл
			
			Движение             = Движения.KPI_РабочееВремяСотрудников.Добавить();
			Движение.Период      = КонецДня(Дата(нГод, нМесяц, НомерДня));
			Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
			Движение.Сотрудник   = ТекСтрока.Сотрудник;
			Движение.Часов       = ТекСтрока["Часов"+НомерДня];
			//Движение.План = ПланПоДаннымПроизводственногоКалендаря;
			Движение.Явка        = Истина;			
		КонецЦикла;
		
	КонецЦикла;		
	
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	Ответственный = ПараметрыСеанса.KPI_ТекущийСотрудник.СтруктураКомпании;
	
КонецПроцедуры
