
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Список.Параметры.УстановитьЗначениеПараметра("Цель"       , Параметры.Цель);
	Список.Параметры.УстановитьЗначениеПараметра("ТекущаяДата", ТекущаяДата());

КонецПроцедуры


&НаКлиенте
Процедура СписокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	
	СтруктураЗначений = Новый Структура;
	СтруктураЗначений.Вставить("Форма", "ФормаВыбораДляСоответствияСЦелью");
	СтруктураЗначений.Вставить("ЦП", Элемент.ТекущиеДанные.ЦелевойПоказатель);
	
	ОповеститьОВыборе(СтруктураЗначений);
КонецПроцедуры


