
Перем KPI_глИспользоватьПодсистемуУПЦ Экспорт; //переменная хранит признак использования системы KPI

Перем KPI_глВерсияКонфигурации Экспорт; //Переменная хранит версию конфигурацию KPI

Процедура ПередНачаломРаботыСистемы(Отказ)
	
	KPI_ИнтерфейсКлиент.МодульУправляемогоПриложения_ПередНачаломРаботыСистемы();
	
КонецПроцедуры

Процедура ПриНачалеРаботыСистемы()
	
	KPI_ИнтерфейсКлиент.МодульУправляемогоПриложения_ПриНачалеРаботыСистемы();
	
КонецПроцедуры


KPI_глВерсияКонфигурации = "2.0.1.1";


