
Функция РассчитатьЗначениеЦелевогоПоказателя(СтрокаЦелевойПоказатель, Сотрудник, ПланыФакты, АдресПланФакты) Экспорт
	
	ЗначениеПоказателя = 0;
	ЦелевойПоказатель = СтрокаЦелевойПоказатель.ЦелевойПоказатель;
	
	КритерийПоискаСотрудник = Новый Структура;
	КритерийПоискаСотрудник.Вставить("СтруктураКомпании", Сотрудник.СтруктураКомпании);
	КритерийПоискаСотрудник.Вставить("ЦелевойПоказатель", ЦелевойПоказатель);
	
	НайденныеСтроки = ПланыФакты.НайтиСтроки(КритерийПоискаСотрудник);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		#ЕСЛИ Сервер Тогда
			СтрокаПланФакт       = НайденныеСтроки[0];
			
			ПредставлениеРесурса = KPI_ИнтерфейсСерверПовтИсп.ПредставленияРесурсаЦелевогоПоказателя(СтрокаЦелевойПоказатель.Ресурс);
			Ресурс               = СтрокаПланФакт[ПредставлениеРесурса];
			
			Если ЗначениеЗаполнено(СтрокаЦелевойПоказатель.МатрицаРаспределения) Тогда
				
				МатрицаРаспределения = СтрокаЦелевойПоказатель.МатрицаРаспределения;
				
				Аналитики = Новый Структура("ЦелевойПоказатель");
				ЗаполнитьЗначенияСвойств(Аналитики, СтрокаПланФакт);
				Если ЗначениеЗаполнено(СтрокаЦелевойПоказатель.КлючАналитики) Тогда
					Аналитики.Вставить("КлючАналитики", СтрокаЦелевойПоказатель.КлючАналитики);
				КонецЕсли;				
				
				ЗначениеПоказателя	 = KPI_ИнтерфейсСерверПовтИсп.ЗначениеРесурсаМатрицыРаспределения(
					АдресПланФакты, МатрицаРаспределения, Аналитики, ПредставлениеРесурса, СтрокаЦелевойПоказатель.Шкала);
				
			Иначе
					
				Попытка
					ЗначениеПоказателя	 = Справочники.KPI_Шкалы.ЗначениеРесурсаЦелевогоПоказателяПоШкале(СтрокаЦелевойПоказатель.Шкала, Ресурс);
				Исключение
					KPI_ИнтерфейсКлиентСервер.СообщитьОбОшибке("Ошибка! не удалось рассчитать показатель """ + ЦелевойПоказатель +""" по сотруднику " + Сотрудник + "." );
					ЗначениеПоказателя = 0;	
				КонецПопытки;
								
			КонецЕсли;
		#КонецЕсли
	КонецЕсли;

	Возврат ЗначениеПоказателя;
КонецФункции